{
  "id": 38,
  "header": "Checklist-LGPD",
  "topicList": [
    "Índice",
    "Como usar?",
    "Responsabilidade",
    "Documentação",
    "Abrangência",
    "Eliminação dos dados",
    "Consentimento",
    "Acesso",
    "Transferência Internacional",
    "Sigilo e segurança",
    "Governança",
    "Contributing",
    "Support",
    "Author",
    "License"
  ],
  "itemGroups": [
    {
      "topic": "Índice",
      "items": [
        {
          "title": "<ol>\n<li><strong><a href=\"#responsabilidade\">Responsabilidade</a></strong>"
        },
        {
          "title": "<strong><a href=\"#documentação\">Documentação</a></strong>"
        },
        {
          "title": "<strong><a href=\"#abrangência\">Abrangência</a></strong>"
        },
        {
          "title": "<strong><a href=\"#eliminação_dos_dados\">Eliminação dos dados</a></strong>"
        },
        {
          "title": "<strong><a href=\"#consentimento\">Consentimento</a></strong>"
        },
        {
          "title": "<strong><a href=\"#acesso\">Acesso</a></strong>"
        },
        {
          "title": "<strong><a href=\"#transferência_internacional\">Transferência Internacional</a></strong>"
        },
        {
          "title": "<strong><a href=\"#sigilo_e_segurança\">Sigilo e segurança</a></strong>"
        },
        {
          "title": "<strong><a href=\"#governança\">Governança</a></strong></li>\n</ol>"
        }
      ]
    },
    {
      "topic": "Como usar?",
      "items": [
        {
          "title": "<p>Todos os itens da <strong>Lista de verificação de conformidade com a LGPD</strong> são necessários para a maioria dos projetos, outros itens referente a segurança especificamente será tratado em outro projeto</p>"
        },
        {
          "title": "<img alt=\"Low\" src=\"data/images/priority/low.svg\"> significa que o item é <strong>recomendado</strong>, mas pode ser omitido em algumas situações particulares.</img>"
        },
        {
          "title": "<img alt=\"Medium\" src=\"data/images/priority/medium.svg\"> significa que o item é <strong>altamente recomendado</strong> e pode eventualmente ser omitido em alguns casos realmente particulares. </img>"
        },
        {
          "title": "<img alt=\"High\" src=\"data/images/priority/high.svg\"> significa que o item <strong>não pode ser omitido</strong> por qualquer motivo. </img><blockquote>\n<p>Você pode contribuir com o <strong><em>Checklist LGPD</em></strong> lendo o <a href=\"\">arquivo README_APP</a>, que explica tudo Sobre o projeto.</p>\n</blockquote><hr/>"
        }
      ]
    },
    {
      "topic": "Responsabilidade",
      "items": [
        {
          "title": "[ ] <strong>Foi indicado um responsável, Encarregado de proteção de dados?</strong>"
        },
        {
          "title": "[ ] As informações do responsável estão publicadas no website?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Documentação",
      "items": [
        {
          "title": "[ ] Existe relatório de impacto à proteção de dados pessoais?"
        },
        {
          "title": "[ ] Caso exista, o relatório contém a descrição dos processos de tratamento de dados pessoais que podem gerar riscos às liberdades civis e aos direitos fundamentais, bem como medidas, salvaguardas e mecanismos de mitigação de risco?"
        },
        {
          "title": "[ ] Os procedimentos de proteção dos dados estão documentados?"
        },
        {
          "title": "[ ] Se existe compartilhamento de dados com terceiros, os contratos já foram revisados para estarem de acordo com a LGPD?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Abrangência",
      "items": [
        {
          "title": "[ ] Sua empresa faz coleta, produção, recepção, classificação, utilização, acesso, reprodução, transmissão, distribuição, processamento, arquivamento, armazenamento, eliminação, avaliação, controle, modificação, comunicação, transferência, difusão e extração de dados pessoais (nome, email, telefone, CPF, etc...)"
        },
        {
          "topic": "Quais departamentos:",
          "items": [
            {
              "title": "[ ] Markeing e vendas"
            },
            {
              "title": "[ ] RH"
            },
            {
              "title": "[ ] Compras"
            },
            {
              "title": "[ ] Financeiro"
            },
            {
              "title": "[ ] Legal"
            },
            {
              "title": "[ ] Portaria"
            }
          ]
        },
        {
          "topic": "Avaliação",
          "items": [
            {
              "title": "[ ] Foi feita avaliação se somente os dados extritamente necessários estão sendo tratados?"
            },
            {
              "title": "[ ] Quais medidas para garaantir a trasnparência são tomadas? Existe registro em procedimento?"
            },
            {
              "title": "[ ] A empresa trata dados pessoais sensíveis (origem racial ou étnica, convicção religiosa, opinião política, filiação a sindicato ou a organização de caráter religioso, filosófico ou político, dado referente à saúde ou à vida sexual, dado genético ou biométrico, quando vinculado a uma pessoa natural).<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
            }
          ]
        }
      ]
    },
    {
      "topic": "Eliminação dos dados",
      "items": [
        {
          "title": "[ ] Os dados são eliminados ao fim do tratamento?"
        },
        {
          "title": "[ ] Existe procedimento que determine por quanto tempo os dados serão armazenados?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Consentimento",
      "items": [
        {
          "title": "[ ] Quando se usam dados pessoais, é obtido o consentimento?"
        },
        {
          "title": "[ ] Existe registro deste consentimento (escrito ou eletrônico)?"
        },
        {
          "title": "[ ] Caso o consentimento seja por escrito, está em uma cláusula destacada das demais cláusulas contratuais?"
        },
        {
          "title": "[ ] O consentimento é específico?"
        },
        {
          "title": "[ ] O consentimento é obtido de forma clara, sem ambiguidades quanto à finalidade?"
        },
        {
          "title": "[ ] Existe procedimento para informar o titular no caso de mudança de finalidade do uso dos dados pessoais?"
        },
        {
          "title": "[ ] Existe procedimento para revogar o consentimento?"
        },
        {
          "title": "[ ] Se os dados forem compartilhados, existe consentimento específico para isso?"
        },
        {
          "title": "[ ] Para o tratamento de dados para fins legais, o titular é informado?"
        },
        {
          "title": "[ ] Se são tratados dados de crianças, é obtido o consentimento de ao menos um dos responsáveis?"
        },
        {
          "title": "[ ] Se houver transferência internacional de dados, existe consentimento específico e em destaque para a transferência, com informação prévia sobre o caráter internacional da operação, distinguindo claramente esta de outras finalidades?"
        },
        {
          "title": "[ ] Os usuários do site são informados sobre quais dados são coletados, de forma ativa ou passiva, ao entrar no site?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Acesso",
      "items": [
        {
          "title": "[ ] Existe canal facilitado para consulta dos dados pelo titular?</li>\n</ul><p>Neste canal tem acesso a:</p>"
        },
        {
          "title": "[ ] I - finalidade específica do tratamento;"
        },
        {
          "title": "[ ] II - forma e duração do tratamento, observados os segredos comercial e industrial;"
        },
        {
          "title": "[ ] III - identificação do controlador;"
        },
        {
          "title": "[ ] IV - informações de contato do controlador;"
        },
        {
          "title": "[ ] V - informações acerca do uso compartilhado de dados pelo controlador e a finalidade;"
        },
        {
          "title": "[ ] VI - responsabilidades dos agentes que realizarão o tratamento; e"
        },
        {
          "title": "[ ] VII - direitos do titular. </li>\n</ul><p><br/></p>"
        },
        {
          "title": "<p>[ ] Existe canal para fornecer ao tituar as seguintes informações sobre seus direitos? </p>"
        },
        {
          "title": "<p>[ ] I - confirmação da existência de tratamento; </p>"
        },
        {
          "title": "[ ] II - acesso aos dados;"
        },
        {
          "title": "[ ] III - correção de dados incompletos, inexatos ou desatualizados;"
        },
        {
          "title": "[ ] IV - anonimização, bloqueio ou eliminação de dados desnecessários, excessivos ou tratados em desconformidade com a lei;"
        },
        {
          "title": "[ ] V - portabilidade dos dados a outro fornecedor de serviço ou produto, mediante requisição expressa e observados os segredos comercial e industrial;"
        },
        {
          "title": "[ ] VI - eliminação dos dados pessoais tratados com o consentimento do titular, exceto nas hipóteses previstas no art. 16 da Lei;"
        },
        {
          "title": "[ ] VII - informação das entidades públicas e privadas com as quais o controlador realizou uso compartilhado de dados;"
        },
        {
          "title": "[ ] VIII - informação sobre a possibilidade de não fornecer consentimento e sobre as consequências da negativa;"
        },
        {
          "title": "[ ] IX - revogação do consentimento.</li>\n</ul><p><br/></p>"
        },
        {
          "title": "[ ] Existe modelo de prestação de informações simplificadas e procedimento para acesso? Qual o canal utilizado?"
        },
        {
          "title": "[ ] Existe modelo de prestação de informações por meio de declaração clara e completa, que indique a origem dos dados, a inexistência de registro, os critérios utilizados e a finalidade do tratamento, observados os segredos comercial e industrial, fornecida no prazo de até 15 dias contado da data do requerimento do titular?"
        },
        {
          "title": "[ ] Os usuários têm conhecimento dos dados compartilhados com outras instituições?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Transferência Internacional",
      "items": [
        {
          "title": "[ ] Se existir transferência intenacional de dados, é feita para países com proteção compatível?"
        },
        {
          "title": "[ ] Existe garantia do regime de proteção de dados através de cláusulas contratuais, normas corporativas globais, selos, certificaos e códigos de conduta regularmente emitidos?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Sigilo e segurança",
      "items": [
        {
          "title": "[ ] Existem procedimentos para garantir o sigilo dos dados?"
        },
        {
          "title": "[ ] Existem assessments quanto ao acesso de dados eletrônicos por terceiros não autorizados?"
        },
        {
          "title": "[ ] Existe log de quem acessou e/ou alterou dados pessoais?"
        },
        {
          "title": "[ ] O acesso aos dados pessoais é protegido, portanto só pessoas autorizadas podem ter acesso?"
        },
        {
          "title": "[ ] Existe procedimento de informação aos titulares caso haja vazamento dos dados?"
        },
        {
          "title": "[ ] O armazenamento dos dados é feitos com criptografia ou outro método que garanta o sigilo?"
        },
        {
          "title": "[ ] Se existe política de privacidade, ela está de acordo com a LGPD?"
        },
        {
          "topic": "GERENCIAMENTO DAS INFORMAÇÕES DA EMPRESA - Burocracia",
          "items": [
            {
              "title": "[ ] É efetuado algum gerenciamento de riscos na organização ?"
            },
            {
              "title": "[ ] A política de segurança da informação é bem definida e entendido por todos ?"
            },
            {
              "title": "[ ] É feito revisão periódica dos itens de segurança pelo comitê responsável ?"
            },
            {
              "title": "[ ] Os riscos terceirizados estão embasados em contrato para garantir a proteção dos dados pessoais ?"
            }
          ]
        },
        {
          "topic": "CIÊNCIA DA RESPONSABILIDADE - Conscientização",
          "items": [
            {
              "title": "[ ] Os funcionários recebem treinamentos periódicos para garantir o conhecimento de suas responsabilidades ?"
            }
          ]
        },
        {
          "topic": "CONTROLES DE ACESSO - Segurança física",
          "items": [
            {
              "title": "[ ] Existe na empresa hábito de restrição de acesso físico somente para quem é permitido ?"
            }
          ]
        },
        {
          "topic": "CONTROLES DE ACESSO - Segurança digital",
          "items": [
            {
              "title": "[ ] Existe na empresa hábito de restrição de acesso digital somente para os administradores de rede ?"
            },
            {
              "title": "[ ] Os dados são mascarados para técnicos de atendimento terem acesso somente ao que precisam ?"
            },
            {
              "title": "[ ] Existe um processo de descarte de equipamentos cuidadoso para que os dados não sejam roubados ?"
            },
            {
              "title": "[ ] Existe uma área isolada só para guardar dados pessoais ?"
            }
          ]
        },
        {
          "topic": "MEIOS DE PROTEÇÃO - Segurança em computador e rede",
          "items": [
            {
              "title": "[ ] Os computadores tem antivírus ?"
            },
            {
              "title": "[ ] Existe autenticação por FSSO ?"
            },
            {
              "title": "[ ] Existem controles para midia removível ?"
            },
            {
              "title": "[ ] Os softwares e o sistema operacional são atualizados com frequência ?"
            },
            {
              "title": "[ ] Existem métodos de desenvolvimento seguro para os sistemas ?"
            },
            {
              "title": "[ ] Existe limitação com o mínimo possível de administradores masters na rede ?"
            },
            {
              "title": "[ ] As credenciais têm características de senha forte ?"
            },
            {
              "title": "[ ] Existe monitoramento que mapeia quem está violando dados pessoais ?"
            },
            {
              "title": "[ ] É feito periodicamente backups e a validação do mesmo ?"
            },
            {
              "title": "[ ] A comunicação com o controlador é feito periodicamente para realizar um levantamento dos eventos ocorridos naquele período ?"
            },
            {
              "title": "[ ] Existem firewalls na borda da rede ?"
            },
            {
              "title": "[ ] É utilizado algum tipo de detecção e prevenção de violação de dados pessoais por meio do IPS ?"
            },
            {
              "title": "[ ] São aplicadas medidas de regulamentação às normas mais conhecidas de padronização dos itens de segurança ?"
            },
            {
              "title": "[ ] Os logs são guardados em um gerenciador de logs ?<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
            }
          ]
        }
      ]
    },
    {
      "topic": "Governança",
      "items": [
        {
          "title": "[ ] Existem regras de boas práticas e de governança que estabeleçam as condições de organização, o regime de funcionamento, os procedimentos, incluindo reclamações e petições de titulares, as normas de segurança, os padrões técnicos, as obrigações específicas para os diversos envolvidos no tratamento, as ações educativas, os mecanismos internos de supervisão e de mitigação de riscos e outros aspectos relacionados ao tratamento de dados pessoais.<p><strong><a href=\"#índice\">⬆ back to top</a></strong></p><hr/>"
        }
      ]
    },
    {
      "topic": "Contributing",
      "items": [
        {
          "title": "<p><strong>Open an issue or a pull request to suggest changes or additions.</strong></p>"
        },
        {
          "topic": "Guide",
          "items": [
            {
              "title": "<p>The <strong>Checklist LGPD</strong> repository consists of two branches:</p>"
            }
          ]
        }
      ]
    },
    {
      "topic": "Support",
      "items": [
        {
          "title": "<p>If you have any question or suggestion, don't hesitate to use Gitter or Twitter:</p>"
        },
        {
          "title": "<a href=\"\">Chat on Gitter</a>"
        },
        {
          "title": "<a href=\"\">Facebook</a>"
        },
        {
          "title": "<a href=\"\">Twitter</a>"
        }
      ]
    },
    {
      "topic": "Author",
      "items": [
        {
          "title": "<p><strong><a href=\"https://github.com/marcialwushu\">Cleilson</a></strong></p>"
        }
      ]
    },
    {
      "topic": "License",
      "items": [
        {
          "title": "<p><a href=\"https://creativecommons.org/publicdomain/zero/1.0/\"><img alt=\"CC0\" src=\"https://i.creativecommons.org/p/zero/1.0/88x31.png\"/></a></p><p><strong><a href=\"#índice\">⬆ back to top</a></strong></p>"
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}