{
  "id": 61,
  "header": "dctb-web-project",
  "topicList": [
    "Índice",
    "1. Briefing",
    "2. Coleta dos Colaboradores",
    "3. Formalização",
    "4. Preparação do Ambiente",
    "5. Documentação",
    "6. Criação",
    "7. Desenvolvimento",
    "8. Testes",
    "9. Publicação",
    "10. Otimização",
    "11. Apresentação ao Cliente",
    "12. Liberação",
    "13. Divulgação"
  ],
  "itemGroups": [
    {
      "topic": "Índice",
      "items": [
        {
          "title": "<ol>\n<li><a href=\"#briefing\">Briefing</a>"
        },
        {
          "title": "<a href=\"#coleta-dos-colaboradores\">Coleta dos Colaboradores</a>"
        },
        {
          "title": "<a href=\"#formalizacao\">Formalização</a>"
        },
        {
          "title": "<a href=\"#preparacao-do-ambinete\">Preparação do Ambiente</a>"
        },
        {
          "title": "<a href=\"#documentacao\">Documentação</a>"
        },
        {
          "title": "<a href=\"#criacao\">Criação</a>"
        },
        {
          "title": "<a href=\"#desenvolvimento\">Desenvolvimento</a>"
        },
        {
          "title": "<a href=\"#testes\">Testes</a>"
        },
        {
          "title": "<a href=\"#publicacao\">Publicação</a>"
        },
        {
          "title": "<a href=\"#otimizacao\">Otimização</a>"
        },
        {
          "title": "<a href=\"#apresentacao-ao-cliente\">Apresentação ao Cliente</a>"
        },
        {
          "title": "<a href=\"#liberacao\">Liberação</a>"
        },
        {
          "title": "<a href=\"#divulgacao\">Divulgação</a>"
        },
        {
          "title": "<a href=\"#conclusao\">Conclusão</a></li>\n</ol><hr/><p>A seguir os passos para a criação de um <strong>Projeto Web</strong>:</p>"
        }
      ]
    },
    {
      "topic": "1. Briefing",
      "items": [
        {
          "title": "<p>Esta é a etapa em que se deve entender o negócio do cliente, suas necessidades, e junto com ele identificar:</p><ol>\n<li>Como é seu negócio? Como é o seu produto? Como será o seu serviço?"
        },
        {
          "title": "Qual será o objetivo do <em>website</em>?"
        },
        {
          "title": "Qual será o público-alvo? Quando possível identificar:"
        },
        {
          "title": "Classe Social;"
        },
        {
          "title": "Sexo;"
        },
        {
          "title": "Faixa-etária;"
        },
        {
          "title": "Limitações Técnicas;"
        },
        {
          "title": "Necessitam de algum tipo de Acessibilidade?</li>\n</ol><p>Com estas informações, é hora de definir o escopo do projeto. Neste momento é importante definir quais serão as funcionalidades que o website deverá apresentar.</p><p>O Briefing pode gerar um <strong>Documento de Escopo</strong>. Este documento servirá de guia para o desenvolvimento, e é uma garantia por ambas as partes de que o projeto sairá como o combinado.</p><p>Um importante artefado que pode ser incluído no <strong>Documento de Escopo</strong> é o <strong>SiteMap</strong>, no qual todas as páginas e ligações entre elas estarão identificadas em um diagrama.</p>"
        }
      ]
    },
    {
      "topic": "2. Coleta dos Colaboradores",
      "items": [
        {
          "title": "<p>É importante saber quais serão as pessoas envolvidas no projeto, por isso é importante catalogar todos os colaboradores que participarão do projeto, armazenando informações como:</p><ol>\n<li>Nome Completo;"
        },
        {
          "title": "RG;"
        },
        {
          "title": "CPF;"
        },
        {
          "title": "Redes Sociais;"
        },
        {
          "title": "Endereço;"
        },
        {
          "title": "Telefones;"
        },
        {
          "title": "Emails.</li>\n</ol><p>Essas informações serão úteis na elaboração do contrato e na comunicação entre os envolvidos.</p><p>Além das informações de cada membro da equipe de desenvolvimento, <strong>é imporante coletar os mesmos dados para os contatos responsáveis no cliente</strong>.</p>"
        }
      ]
    },
    {
      "topic": "3. Formalização",
      "items": [
        {
          "title": "<p>Com o <strong>Documento de Escopo</strong> e as informações dos colaboradores, é o momento de formalizar seu projeto. É nesta etapa que um contrato deve ser elaborado e assinado por ambas as partes.</p>"
        }
      ]
    },
    {
      "topic": "4. Preparação do Ambiente",
      "items": [
        {
          "title": "<p><em>Antes de trabalhar, temos que arrumar a mesa.</em></p><p>Então nesta etapa seguirão algumas dicas de como organizar seu projeto antes de começar o seu desenvolvimento.</p><ol>\n<li><strong>Comunicação</strong> - Defina algum veículo de comunicação entre os colaboradores do projeto e entre o responsável pelo projeto e seu cliente. Isso pode ser feito por Email, Skype, ou alguma ferramenta específica como o Slack;"
        },
        {
          "title": "<strong>Repositórios</strong> - Trabalhar com repositórios é indispensável para agilizar e manter a equipe sincronizada, é importante nesta etapa criar, e configurar seus repositórios, além dar permissão para os outros colaboradores;"
        },
        {
          "title": "Definir o nome para o <strong>domínio</strong> e registrá-lo ou transferí-lo;"
        },
        {
          "title": "Contratar um <strong>plano de hospedagem</strong> que atenda os requisitos técnicos do projeto;"
        },
        {
          "title": "Configurar o <strong>servidor</strong> para receber o repositório criado;"
        },
        {
          "title": "Se for comércio eletrônico:"
        },
        {
          "title": "Definir as instituições bancárias e formas de pagamento;"
        },
        {
          "title": "Abrir conta, assinar convênios e solicitar serviços de comércio eletrônico;"
        },
        {
          "title": "Definir e criar <strong>contas de e-mail</strong>. Isso é muito importante pois impulsiona o cliente por já ter uma conta de e-mail no seu próprio domínio;"
        },
        {
          "title": "Definir e criar uma conta de email específica para o site no gmail. Isso é importante para cadastrar Plugins, Serivços e principalmente Analytics;"
        },
        {
          "title": "Criar contas em <strong>redes sociais</strong>. É importante que um projeto web tenha seu reflexo nas redes sociais, então, dependendo do que foi acordado, este é o momento para definir os nomes e criar as redes sociais, dentre as mais comuns:"
        },
        {
          "title": "Twitter;"
        },
        {
          "title": "YouTube;"
        },
        {
          "title": "FaceBook;"
        },
        {
          "title": "Instagram;"
        },
        {
          "title": "Google Plus;"
        },
        {
          "title": "Criar ou resgatar <strong>conta de monitoramento</strong> (Google Analytics)"
        },
        {
          "title": "Caso o site já exista:"
        },
        {
          "title": "Fazer um backup de segurança do site antigo;"
        },
        {
          "title": "Fazer um backup de segurança do banco de dados antigo;"
        },
        {
          "title": "Análise de popularidade (Estatísticas de Acesso, Ranking em Ferramentas de Busca). Isso ajudará a mostrar os resultados em comparações com os resultados a serem obtidos com o novo projeto;</li>\n</ol>"
        }
      ]
    },
    {
      "topic": "5. Documentação",
      "items": [
        {
          "title": "<p>Nesta fase deve-se focar os esforços em projetar o website. Em projetos mais complexos, é nesta etapa em que se deve criar os diagramas de <strong>Entidades e Relacionamentos</strong> e de <strong>Classes</strong>, por exemplo.</p><p>Em projetos menores, basta uma reunião com a equipe de Design para transformar as funcionalidades descritas no <strong>Documento de Escopo</strong> em <strong>wireframes</strong>.</p>"
        }
      ]
    },
    {
      "topic": "6. Criação",
      "items": [
        {
          "title": "<p>Esta etapa é focada aos Designers, que desenvolverão o <em>layout</em> do website.</p><p>Antes da criação do <strong>wireframe</strong> uma serie de atividades devem ser observadas:</p><ol>\n<li>Analisar <strong>identidade visual</strong> da empresa, produto ou serviço;"
        },
        {
          "title": "Definir <strong>seções e blocos</strong> de informação;"
        },
        {
          "title": "Desenhar <strong>mapa do site</strong> e <strong>fluxo de navegação</strong>;"
        },
        {
          "title": "Estudar e definir a <strong>paleta de cores</strong>;"
        },
        {
          "title": "Estudar e difinir <strong>símbolos e ícones</strong>;"
        },
        {
          "title": "Definir <strong>tipografia</strong>;"
        },
        {
          "title": "Criação/Adaptação de um <strong>logotipo da empresa</strong>;"
        },
        {
          "title": "Definir <strong>efeitos visuais</strong> (recursos multimídia);</li>\n</ol><p>Com estas etapas definidas e os <strong>wireframes</strong> prontos, o designer deve iniciar a criação dos arquivos de <strong>Imagem</strong> (PSD).</p><p>Via de regra, não é necessário a criação do <em>layout</em> final de todas as páginas do projeto. A criação da página principal e uma página interna agiliza muito o trabalho de todos os envolvidos.</p><p>Em projeto mais complexos, pode ser interessante a criação de um documento de <strong>\"Guia de Design\"</strong>, no qual o <em>designer</em> define as etapas anteriores em um documento textual, que será o guia do desenvolvedor durante todo o desenvolvimento.</p><p>Mas é essencial que, pelo menos as telas mais importantes sejam desenvolvidas. Este será o material a ser aprovado pelo cliente antes da próxima etapa.</p>"
        }
      ]
    },
    {
      "topic": "7. Desenvolvimento",
      "items": [
        {
          "title": "<p>Após a aprovação do layout pelo cliente, pode-se iniciar o desenvolvimento propriamente dito.</p><p>Quase sempre dividimos uma aplicação web em três partes: <em>Front-End</em>, <em>Back-End</em> e <em>Integração</em>.</p><p>A parte de <strong>Front-End</strong> é responsável por transformar a Imagem do site criada pelo Designer em uma página de base codificada (HTML5/JavaScript/CSS) funcional.</p><p>A parte de <strong>Back-End</strong> é responsável por implementar as funcionalidades definidas no <strong>Documento de Escopo</strong>.</p><p>A parte de <strong>Integração</strong> é responsável por ligar os as funcionalidades do <strong>Back-End</strong> com o <strong>Front-End</strong>. Normalmente isso pode ser feito através de integrações JavaScript do <strong>Front-End</strong> que consomem a API definida no <strong>Back-End</strong>.</p><p>Uma série de passos podem ser seguidos para realizar as três etapas com sucesso:</p>"
        },
        {
          "title": "Criar estrutura de pastas;"
        },
        {
          "title": "Baixar, instalar e configurar dependências (<em>framework_s, _plugins</em> e <em>APIs</em>);"
        },
        {
          "title": "Recortar o <em>layout</em> e criar base codificada (HTML5/JavaScript/CSS);"
        },
        {
          "title": "Criar e organizar <em>Meta-Informações</em> de cada página (<em>MetaTags</em>);"
        },
        {
          "title": "Criar OG (<em>OpenGraph</em>) para cada página;"
        },
        {
          "title": "Criar Schemas (<em>Schemas.org</em>) para cada elemento da página;"
        },
        {
          "title": "Configurar rotas para as páginas (ou .httaccess);"
        },
        {
          "title": "Configurar ferramenta para minificação de CSS e JS;"
        },
        {
          "title": "Criar <em>sitemap.xml</em>;"
        },
        {
          "title": "Criar <em>robots.txt</em>;"
        },
        {
          "title": "Criar páginas com conteúdo estático;"
        },
        {
          "title": "Criar banco de dados;"
        },
        {
          "title": "Popular banco de dados com valores iniciais ou importação de dados pré-existentes;"
        },
        {
          "title": "Criar estrutura de Back-End: Criação dos CRUDS;"
        },
        {
          "title": "Realizar integração Back-End com Front-End;<p>Ps. A ordem destas tarefas pode ficar a critério de cada equipe.</p><p>Todas as funcionalidades devem ser testadas por cada colaborador, até que o sistema chege a um ponto de maturidade no qual precisa de testes mais específicos.</p><p>Cada projeto possui uma particularidade de como os testes serão realizados, testes automáticos quase sempre é uma boa opção para projetos maiores, entretanto, para projetos de medio e pequeno porte, o bom e velho teste convencional dá conta do recado. Pois você passará menos tempos testando que escrevendo os casos de teste.</p>"
        }
      ]
    },
    {
      "topic": "8. Testes",
      "items": [
        {
          "title": "<p>Esta é uma fase importante, e que provavelmente será feita algumas vezes.</p><p>Alguns detalhes que não podem ser esquecidos:</p><ol>\n<li>Renderização em diferentes navegadores;"
        },
        {
          "title": "Renderização em diferentes versões de navegadores;"
        },
        {
          "title": "Navegação da página;"
        },
        {
          "title": "Leitura do conteúdo;"
        },
        {
          "title": "Desempenho em ambiente de produção;"
        },
        {
          "title": "Funcionalidades respondem como o esperado?"
        },
        {
          "title": "Qualidade das Imagens;</li>\n</ol><p>Além disso é importante utilizar algumas ferramentas de testes automáticos como:</p>"
        },
        {
          "topic": "Teste de responsividade",
          "items": [
            {
              "title": "<p>https://www.google.com/webmasters/tools/mobile-friendly</p>"
            }
          ]
        },
        {
          "topic": "Schemas",
          "items": [
            {
              "title": "<p>https://developers.google.com/structured-data/testing-tool/</p>"
            }
          ]
        },
        {
          "topic": "Meta Tags",
          "items": [
            {
              "title": "<p>http://www.seocentro.com/tools/search-engines/metatag-analyzer.html</p><p>http://analyzer.metatags.org/</p>"
            }
          ]
        },
        {
          "topic": "SEO",
          "items": [
            {
              "title": "<p>http://seositecheckup.com/</p>"
            }
          ]
        }
      ]
    },
    {
      "topic": "9. Publicação",
      "items": [
        {
          "title": "<p>Depois que os testes foram relizados, é a hora de publicar o projeto.</p><p>Claro, que seu cliente já deve ter visto uma previa do website em algum ambiente de desenvolvimento, mas é neste momento que o <em>presente deverá ser entregue</em>, então é importante que tudo esteja testado e validado internamente entre a equipe de desenvolvimento antes de ser publicado, para causar uma boa impressão inicial.</p><p>E nós sabmos que, quase sempre, quando colocamos em um ambiente de produção, nem tudo ocorre como o esperado. Algum problema com versão da linguagem ou do banco de dados, então é importante refazer todos os testes também no ambiente final.</p><p>Um checklist pode ser executado:</p><ol>\n<li>Validação de Código;"
        },
        {
          "title": "Meta-informações;"
        },
        {
          "title": "Título das páginas;"
        },
        {
          "title": "Integridade de Links;"
        },
        {
          "title": "Qualidade de Imagens;"
        },
        {
          "title": "Qualidade de Textos;"
        },
        {
          "title": "Funcionamento e navegação de formulários;\n8.Pontos de acessibilidade.</li>\n</ol><p>É importante lembrar que nesta etapa normalmente se utiliza uma <em>SplashScreen</em> com alguma informação de <em>\"Site em Construção\"</em> até a etapa de liberação do website.</p>"
        }
      ]
    },
    {
      "topic": "10. Otimização",
      "items": [
        {
          "title": "<p>Quando o site é efetivamente publicado, ainda temos que fazer alguns ajutes finos para colocar em ação os scripts de monitoramentos statísticos. Então, agora é a hora de configurar o Analytics do Google.</p><p>E é claro que o sitemap.xml tem que ser atualizado, e para isso você pode utilizar alguma programação interna ou ferramentas personalizadas.</p>"
        }
      ]
    },
    {
      "topic": "11. Apresentação ao Cliente",
      "items": [
        {
          "title": "<p>Dependendo da complexidade, essa pode ser a hora para a criação de um <strong>manual de utilização do site</strong>, explicando passo a passo, como navegar no site, e até mesmo detalhes de sua área administrativa.</p><p>Além disso, é importante oferecer um treinamento para as pessoas que serão responsáveis alimentar as informações do website.</p>"
        }
      ]
    },
    {
      "topic": "12. Liberação",
      "items": [
        {
          "title": "<p>Esta etapa é apenas a retirada da <em>SplashScreen</em> e a liberação do acesso ao público.</p>"
        }
      ]
    },
    {
      "topic": "13. Divulgação",
      "items": [
        {
          "title": "<p>O site precisa de um empurrão inicial, então alguns pontos podem ser observados:</p><ol>\n<li>Realizar parcerias ou trocas de banners ou links, entre sites de amigos ou parceiros de negócios;"
        },
        {
          "title": "Buscar alternativas de publicidades online, como portais de conteúdo (UOL, TERRA, IG, GLOBO.COM), ou sites de conteúdo direcionado;"
        },
        {
          "title": "Buscar alternativas de anúncios pagos em serviços de busca (Links Patrocinados);"
        },
        {
          "title": "Realizar o acompanhamento e mensuração dos resultados de seus investimentos em publicidade de divulgação do site.</li>\n</ol>"
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}