{
  "id": 117,
  "header": "Launch-Checklist",
  "topicList": [
    "Assignment Requirements",
    "How Your Assignment is Graded"
  ],
  "itemGroups": [
    {
      "topic": "Assignment Requirements",
      "items": [
        {
          "title": "<p>For this \"Launch Checklist Form\" assignment, you will use a form submission and fetch request to accomplish the following:</p><ol>\n<li>Validate the user responses with <code>preventDefault()</code> to ensure the following: </li>\n</ol><p>a. The user has entered something for every field.</p><p>b. The user has entered string values for names and number for fuel and cargo levels.</p><ol>\n<li>With validation, update a list of what is currently ready or not ready for the shuttle launch."
        },
        {
          "title": "Use the DOM to update CSS to indicate what is good and bad about the shuttle and whether it is ready for launch."
        },
        {
          "title": "Fetch some planetary JSON to update the mission destination with vital facts and figures about where the shuttle is headed.</li>\n</ol><p>The submitted web page will look similar to the <a href=\"http://launch-checklist-launchcodeeducation.s3-website-us-east-1.amazonaws.com/\">demo app</a>.</p>"
        }
      ]
    },
    {
      "topic": "How Your Assignment is Graded",
      "items": [
        {
          "topic": "Grading Tests",
          "items": [
            {
              "title": "<p>You can run the tests locally or check out Github Classroom to see if your work passes the autograding tests. Remember in Github Classroom, if you have passed all the tests, you get a green checkmark and if one or more of the tests fails, then you get a red \"x\". </p><p><em>Note</em>: Running <code>npm test</code> locally will result in one <code>grading-dom</code> test failing. This has to do with the asynchronous nature of fetch and should pass in the Github Classroom autograder.</p><p>A passing assignment will have an output of: <code>11 specs, 0 failures</code>.</p><p>If the output matches above, your submission meets the testing requirements! </p>"
            }
          ]
        },
        {
          "topic": "Beyond the Tests",
          "items": [
            {
              "title": "<p>After reviewing the test output, your TA will check your submission for the following:</p><ol>\n<li>Is the top box populated with the planetary data from the fetch request?"
            },
            {
              "title": "On invalid form submission:</li>\n</ol><p>a. Is the form data persistent? The page should not reload here.</p><p>b. Does an alert appear if an empty or partially filled form is submitted? Is the alert message relevant?</p><p>c. Does an alert appear if incorrect data is entered in any field? Names should be strings and fuel and cargo amounts should be numbers.</p><ol>\n<li>On valid form submission:</li>\n</ol><p>a. Do the pilot and co-pilot values submitted appear as the names in the third box?</p><p>b. Does the fuel value message reflect if the submitted value is too low (less than 10,000) or in the correct range?</p><p>c. Does the cargo value message reflect if the submitted value is too high (more than 10,000) or in the correct range?</p><p>d. Is the header message red and does it read 'Shuttle Not Ready for Launch' when either fuel or cargo are not in range?</p><p>e. Is the header message green and does it read 'Shuttle is Ready for Launch' when both fuel and cargo are submitted in range?</p><ol>\n<li>You added JavaScript in <code>script.js</code> that is enclosed within a load event listener."
            },
            {
              "title": "A submit event listener handles the form submission."
            },
            {
              "title": "<code>event.preventDefault()</code> stops the default form submission behavior."
            },
            {
              "title": "Form validation includes logic for incomplete and inappropriate field data types."
            },
            {
              "title": "The list items in the third box use template literals to display submitted values."
            },
            {
              "title": "Status message content and styling changes if the shuttle is ready for launch or not."
            },
            {
              "title": "CSS updates are made via DOM methods. <code>styles.css</code> remains unchanged."
            },
            {
              "title": "A fetch request hits the <a href=\"https://handlers.education.launchcode.org/static/planets.json\">planets API</a>,\n   an item from the response is selected and its values are displayed in the DOM using more template literals.\n   In the assignment, you can select whichever planet they want. If you have attempted the bonus mission, then your code is randomly selecting an item from the planets API.</li>\n</ol><p>When you are done with the assignment, submit the link to your repository on Canvas.</p>"
            }
          ]
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}