{
  "id": 121,
  "header": "meetup-checklist",
  "topicList": [
    "Deciding on the format",
    "Deciding on a date",
    "The venue",
    "Finding the audience",
    "Keeping up interest",
    "The speakers",
    "On the day",
    "Post event",
    "Other useful resources"
  ],
  "itemGroups": [
    {
      "topic": "Deciding on the format",
      "items": [
        {
          "title": "Ask friends and colleagues if the topic will be of interest first"
        },
        {
          "title": "Are they talks or show and tells?"
        },
        {
          "title": "Keep the talks short if possible (around 20-30 mins max)"
        },
        {
          "title": "Try 2-3 speakers on a theme"
        },
        {
          "title": "Do you need a photographer?"
        }
      ]
    },
    {
      "topic": "Deciding on a date",
      "items": [
        {
          "title": "Informing people of the date 4-6 weeks ahead"
        },
        {
          "title": "Don't bother crowdsourcing an ideal date, just pick one"
        },
        {
          "title": "Avoid Mondays and Fridays"
        },
        {
          "title": "Check for other events that may cannibalise audience"
        }
      ]
    },
    {
      "topic": "The venue",
      "items": [
        {
          "title": "Does it have wifi for audience?"
        },
        {
          "title": "Is the venue accessible, does it have accessible toilets"
        },
        {
          "title": "Is it in a safe location? How far is public transport?"
        },
        {
          "title": "What are the fire evacuation procedures?"
        },
        {
          "title": "What parking is available?"
        },
        {
          "title": "Book the room for at least 2 hours before it starts and 30 mins after to allow time for setup and overrun"
        },
        {
          "title": "Make sure you visit the venue beforehand, speak to the building reception about the event"
        }
      ]
    },
    {
      "topic": "Finding the audience",
      "items": [
        {
          "title": "Promote the event in the places your audience frequent. For my audience I posted on the cross-government slack, the service design mailing list and asked the Gov Design twitter account to retweet for me."
        },
        {
          "title": "Obviously, tweet about it and post on facebook. You're probably friends with the type of audience you are looking for so ask them to help promote it and talk to people about it."
        },
        {
          "title": "Warn people if you plan to take photos and offer the option to opt out"
        }
      ]
    },
    {
      "topic": "Keeping up interest",
      "items": [
        {
          "title": "Give the audience a start time for showing up and the time the talks will start"
        },
        {
          "title": "If its gov only - ask people to sign up with their gov email address"
        },
        {
          "title": "Post updates regularly (but not too frequently so that you annoy people)"
        },
        {
          "title": "Either setup an event twitter account or ask your audience to follow you"
        },
        {
          "title": "Send reminder emails via eventbrite"
        },
        {
          "title": "Setup a waiting list on eventbrite"
        },
        {
          "title": "Inform attendees of the plans after the event so that they can allow for that with trains etc"
        },
        {
          "title": "Create a poster for the day and put up in relevant communal spaces"
        },
        {
          "title": "When speakers are confirmed ensure you email the audience and update the event page with information"
        }
      ]
    },
    {
      "topic": "The speakers",
      "items": [
        {
          "title": "Ensure once you have found people interested in speakers that you clearly confirm via email"
        },
        {
          "title": "Are the speakers diverse? Are there other places to source speakers outside of your typical experience?"
        },
        {
          "title": "Send a regular email updating them on important details (like attendee numbers)"
        },
        {
          "title": "Send a photo of the room and give details on the space available"
        },
        {
          "title": "Ask them to send you copies of their slides and run from one computer if possible (to minimise disruption from change overs)"
        },
        {
          "title": "Tell them how long it takes to get to venue"
        },
        {
          "title": "Do they need any help getting to the venue and home?"
        },
        {
          "title": "Inform them if there are mics or audio speakers available"
        },
        {
          "title": "Inform them exactly how long their speaking slot is and how the day will work (will someone introduce them, when they are done speaking what should they do, is there time allocated for Q&amp;A?)"
        },
        {
          "title": "Think about having a back up speaker in case someone cancels last minute - would be easier if that was the organiser"
        },
        {
          "title": "Setup a shared google doc with the planned agenda, timings and your contact information. Ask everyone to add a sentence about the talk and bio info."
        },
        {
          "title": "Set deadline of the day before for slides to be sent to you. You need time to check them. Remind them regularly about this, they will be late."
        }
      ]
    },
    {
      "topic": "On the day",
      "items": [
        {
          "title": "Check through each slide deck submitted to make sure there are no issues (do videos play? are there any font issues?)"
        },
        {
          "title": "See if its possible to put your poster in the window of the venue for the attendees"
        },
        {
          "title": "If neccessary, make sure reception have an up to date list of attendees"
        },
        {
          "title": "Have someone help you complete the register and direct people to the room"
        },
        {
          "title": "Make a backup of the slides on online storage that you can access"
        },
        {
          "title": "Make contingencies for no internet"
        },
        {
          "title": "Make pdf versions of the slides as a backup"
        },
        {
          "title": "Get spare video cables, bring a spare usb drive with the slides on, bring a spare video connection convertor"
        },
        {
          "title": "Hold the front row of chairs for the speakers to make change overs easier"
        },
        {
          "title": "Check that the projector and connections are working. Test audio."
        },
        {
          "title": "Test that the wifi works"
        },
        {
          "title": "Have an intro slidedeck ready - give an overview, point out toilets, fire exits and the evacuation procedure"
        },
        {
          "title": "Have an end slidedeck to direct people to the pub you're going to and to thank people. If possible inform them of the next event date"
        }
      ]
    },
    {
      "topic": "Post event",
      "items": [
        {
          "title": "Send thank you message to speakers, attendees and anyone who helped"
        },
        {
          "title": "Send questionnaire to speakers"
        },
        {
          "title": "Send questionnaire to attendees and promote the next event"
        }
      ]
    },
    {
      "topic": "Other useful resources",
      "items": [
        {
          "topic": "Tools",
          "items": [
            {
              "title": "<a href=\"https://trello.com\">Trello</a> - for keeping you organised"
            },
            {
              "title": "<a href=\"https://eventbrite.co.uk\">Eventbrite</a> - for hosting the event page, ticket sales management and contacting audience"
            },
            {
              "title": "<a href=\"http://attending.io\">Attending.io</a>"
            }
          ]
        },
        {
          "topic": "Articles on organising a meetup",
          "items": [
            {
              "title": "https://daveredfern.com/2016/ive-learned-organising-meetup/"
            },
            {
              "title": "https://techspark.co/need-to-know-how-to-build-a-top-tech-meetup-group/"
            },
            {
              "title": "http://inside.envato.com/guide-to-meetups/"
            },
            {
              "title": "http://conference-handbook.readthedocs.io/timeline.html"
            }
          ]
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}