{
  "id": 134,
  "header": "NFT-anti-hack-checklist",
  "topicList": [
    "Security Measures for Developers:",
    "Safety Tips For Users:"
  ],
  "itemGroups": [
    {
      "topic": "Security Measures for Developers:",
      "items": [
        {
          "title": "<p>| Serial No | Topic | Description |\n| --- | --- | --- |\n| 1 | <strong>After Deployment, Transfer Ownership to the Multisig</strong> |When deploying contracts, your NFT contract has the wallet address you used to deploy it set as its current owner. Multisig ownership is more secure, we should transfer ownership to the multisig created earlier after deployment. |\n| 2 | <strong>Use the latest version of Solidity/Rust</strong> | When deploying NFTs, use the most recent version of Solidity/Rust. This is due to the regularity with which breaking updates, new features, and bug fixes are introduced. Check that your code has no reported issues with the latest compiler version. |\n| 3 | <strong>Hire experienced developers</strong> | To ensure you develop the best NFT project out there, make sure to hire a developer who is skilled and experienced. |\n| 4 | <strong>Full unit test coverage</strong> | Unit testing improves software quality with every code check-in and build. Unit testing is the quickest, most direct way to identify and fix bugs before they influence the main codebase.\n| 5 | <strong>Follow well-known programming practices</strong> | Smart contracts are developed using different programming languages, such as Solidity, Vyper, Rust, etc. The development of smart contracts has proven to be extremely error-prone. It is important to follow best programming practices to develop secure NFT. |\n| 6 | <strong>Log all crucial operations</strong> | Events will aid in contract debugging during development and contract monitoring after deployment. So, It is recommended to emit events for critical functions like changing owners, minting, burning tokens, etc. |\n| 7 | <strong>Use the latest and well-tested libraries</strong> | Always use the latest and well-tested libraries like openzeppelin. These libraries are well tested, and community-reviewed contracts, so they are considered more secure. For example, If we want to write an NFT contract, we can use OpenZeppelin's ERC721 Library. See here for <a href=\"https://docs.openzeppelin.com/contracts/4.x/erc721\">more</a> details. |\n| 8 | <strong>Avoid known pitfalls and common NFT vulnerabilities</strong> | Learn the most pitfalls and common security vulnerabilities in NFT contracts and how to mitigate them. Watch out for common bugs like Reentrancy, Denial of Service, etc. Do check out <a href=\"https://github.com/Quillhash/NFT-Attack-Vectors\">NFT Attack Vectors</a> which contains a  complete list of NFT Attacks. |\n| 9 | <strong>Access Control Protection for critical operations</strong> | Hackers can easily exploit an NFT contract if access control is handled poorly or not at all. So, the protocol needs to implement access control protection and restrict critical functions like changing owners, pausing contracts, etc. to the owner/admin role. |\n| 10 | <strong>Always list NFTs in a Reputable and secure marketplace</strong> | Try to list your NFTs in a more secure NFT Marketplace, as there have been many incidents in the past of NFT marketplace vulnerability leading to stealing users' NFTs. So, choose NFT Marketplace wisely. |\n| 11 | <strong>NFT audits</strong> | Audit will help us detect uneven and unexpected vulnerabilities of NFT projects before deployment and, therefore, ensure security.\n| 12 | <strong>Bug bounty program</strong> | Projects can host their bug bounty program or integrate with Bug Bounty Platforms like Immunefi or Hackerone. It adds an extra layer of security for the projects. |\n| 13 | <strong>Safeguard wallet of Admin/Owner</strong> | The Admin role is used to manage upgrades and various privileges role in logic. If the private key of the admin/owner of an NFT contract is leaked, the entire NFT project may be destroyed. So, Properly secure your wallet and always use a hardware wallet or a multisig wallet which is considered more secure. Check out this <a href=\"https://blog.trailofbits.com/2018/11/27/10-rules-for-the-secure-use-of-cryptocurrency-hardware-wallets/\">blog</a> for more details on wallet security. |\n| 14 | <strong>Enable Authentication Methods/ 2FA to prevent Social account hacks.</strong> | There are lots of scenarios where these NFT projects' social media accounts like Discord and Twitter are hacked, and the hackers use the compromised accounts for their gain. Check out this <a href=\"https://medium.com/quillhash/analysing-nfts-discord-server-hacks-quillaudits-46f8d874f913\">blog</a> for more details on NFT social media hacks and their prevention methods.\n| 15 | <strong>Add checks for Weak Random Number Generation</strong> | The weak PRNG issue is way too common in the NFT gaming ecosystem. It is recommended to use Chainlink VRF for generating a PRNG. Never use predefined methods related to the block like block.timestamp, block.number, or a controlled user input for generating random numbers. </p><hr/>"
        }
      ]
    },
    {
      "topic": "Safety Tips For Users:",
      "items": [
        {
          "title": "<p>| Serial No | Topic | Description |\n| --- | --- | --- |\n| 1 | <strong>Only trade on reputable NFT marketplaces</strong> | Security is an important consideration for many NFT traders, especially given there have already been several high-profile platform hacks. So, try to trade at a reputable and secure nft marketplace.\n| 2 | <strong>Use two-factor authentication to add an extra layer of security to your crypto wallet.</strong> | Try using two-factor authentication (2FA) wherever possible. This is one of the strongest forms of authentication, as hackers would need to have your password and access your mobile phone to log into your wallet. The best way to store your NFTs is through a hardware wallet since it’s offline.\n| 3 | <strong>Regularly back up your wallet</strong> | A backup of your wallet can protect you from computer problems as well as many human errors. If you keep your wallet encrypted, you may be able to recover it if your phone or computer is destroyed.\n| 4 | <strong>Never blind-sign NFT transactions</strong> | Before confirming the transaction, always examine the permission details in the smart contracts. Many hackers disguise their actions in smart contracts, giving them unauthorized access to funds in your wallet. If possible try to read the smart contract details carefully and validate that they do not provide a threat or vulnerability.\n| 5 | <strong>Research well before you invest</strong> | There have been many incidents in the past where the NFT team abandons their project and disappears with the money raised from investors. So, before investing in an NFT initiative, conduct your research. Before investing, research the project founders' profiles and backgrounds.\n| 6 | <strong>Always review your token approvals &amp; revoke unused ones</strong> | Every day, we engage with various protocols and links, granting them access and permission depending on the information in the smart contract. It is critical to periodically check and revoke access and permissions granted. You can use <a href=\"https://revoke.cash\">revoke.cash</a> to cancel access.\n| 7 | <strong>Download web3 apps or wallets from official websites</strong> | One of the biggest causes of crypto/NFT hacks is that users access unofficial sites which always look like the official website. Hackers usually use this to embed their malicious contract and once you sign the transaction, they can steal all your nfts/tokens.\n| 8 | <strong>Only interact with official channels, Twitter accounts, and links</strong> | Always restrict your telegram, discord, and email from receiving messages from strangers and unofficial addresses. Use a <a href=\"https://www.makeuseof.com/tag/4-quick-sites-that-let-you-check-if-links-are-safe/\">link-checking</a> website first, which will let you know if a site is legitimate or not.\n| 9 | <strong>Never share your seed phrase or wallet private key with anyone</strong> | If you reveal your seed phrase or private keys with anyone, they will have access to your digital assets. Anyone who has access to your private key/seed phrase can steal all of your tokens and NFT.\n| 10 | <strong>Regularly update your device/software and Protect them with cybersecurity software</strong> | It is easy to encounter malware, spyware, and other malicious software while browsing online. So, it is important to protect your device and data using security software like anti-virus and VPNs for more security.</p><hr/>"
        },
        {
          "topic": "References:",
          "items": [
            {
              "title": "<p>https://web3caff.com/archives/9629 <br/>\nhttps://merehead.com/blog/make-nfts-secure/</p>"
            }
          ]
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}