{
  "id": 166,
  "header": "r-code-review-checklist",
  "topicList": [
    "Summary",
    "General",
    "Documentation and organization",
    "Data management",
    "Syntax",
    "Change control",
    "Pitfalls"
  ],
  "itemGroups": [
    {
      "topic": "Summary",
      "items": [
        {
          "title": "<p>This checklist is designed to serve as an <a href=\"https://docs.github.com/en/communities/using-templates-to-encourage-useful-issues-and-pull-requests/configuring-issue-templates-for-your-repository\">issue template</a> to assist in the code review process for data wrangling/analysis projects developed in R. The focus of the checklist <em>is not</em> R package development and review; rather, it is aimed at teams of data scientists and/or data analysts who write scripts to generate tables, listings, figures, or any other analytic output.</p><p>The checklist follows principles set forth in <a href=\"https://style.tidyverse.org/\">the tidyverse style guide</a> + <a href=\"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1005510\">Good enough practices in scientific computing</a>, and adheres to deodorizing strategies from <a href=\"https://github.com/jennybc/code-smells-and-feels\">Code smells and feels</a>.</p>"
        }
      ]
    },
    {
      "topic": "General",
      "items": [
        {
          "title": "[ ] The code is readable / easy to understand"
        },
        {
          "title": "[ ] The project executes / produces the intended deliverable on an independent machine (i.e. not the developer's computer) using only the code and resources embedded in the repository"
        },
        {
          "title": "[ ] All code is necessary; e.g. functions are not written which accomplish tasks already covered by other approved code bases"
        },
        {
          "title": "[ ] Run-time is not prohibitively long / is appropriate given the nature of the project"
        }
      ]
    },
    {
      "topic": "Documentation and organization",
      "items": [
        {
          "title": "[ ] The repository contains a <code>readme</code> which includes, at minimum, the purpose of the project (e.g. deliverables) and a set of instructions for executing the project from the code in the repository"
        },
        {
          "title": "[ ] File names succinctly describe the purpose of the file"
        },
        {
          "title": "[ ] File names do not contain special characters other than <code>-</code> or <code>_</code>, ideally with <code>-</code> used to separate words and <code>_</code> used to separate categories"
        },
        {
          "title": "[ ] Files that are to be run sequentially are prefixed with numbers, and single digits are padded with leading <code>0</code>s"
        },
        {
          "title": "[ ] Within files, logically separated chunks of code are divided by commented lines of <code>-</code> and/or <code>=</code> with a chunk descriptor"
        },
        {
          "title": "[ ] Comments within chunks begin with <code>#</code> and a single space, and are in sentence case ending in <code>.</code> only when they contain at least 2 sentences"
        },
        {
          "title": "[ ] All package dependencies required for a given script are loaded at the beginning of the file"
        },
        {
          "title": "[ ] Programs are appropriately decomposed into files/functions; ideally, each file is no more than 1 page long (approximately 60 lines)"
        }
      ]
    },
    {
      "topic": "Data management",
      "items": [
        {
          "title": "[ ] External locations of raw data (if the data are too large or are not permitted to be stored directly in the repository) are clearly annotated with written verification that the locations and raw data will not be modified"
        },
        {
          "title": "[ ] All steps used to process data are clearly identifiable (e.g. through good file naming and organization) and reproducible"
        },
        {
          "title": "[ ] Data are not hard-coded/manually written into any script"
        },
        {
          "title": "[ ] Appropriate policy for data storage and access, particularly PHI, is followed"
        }
      ]
    },
    {
      "topic": "Syntax",
      "items": [
        {
          "title": "[ ] Variable and function names use only lowercase letters, numbers, and <code>_</code> (to separate words within a name)"
        },
        {
          "title": "[ ] Variable names are nouns and function names are verbs"
        },
        {
          "title": "[ ] Commas always have a space after, and not before"
        },
        {
          "title": "[ ] A space is used before and after <code>()</code> with <code>if</code>, <code>for</code>, or <code>while</code> (and no spaces appear on either side of <code>(</code> or <code>)</code> with regular function calls)"
        },
        {
          "title": "[ ] Infix operators <code>==</code>, <code>+</code>, <code>-</code>, <code>&lt;-</code>, and <code>=</code> are surrounded by spaces"
        },
        {
          "title": "[ ] <code>{</code> and <code>}</code> are the last and first characters on lines and nested contents are indented by two spaces"
        },
        {
          "title": "[ ] The first <code>%&gt;%</code> in a series is followed by a new line which is indented two spaces"
        },
        {
          "title": "[ ] Styling for <code>+</code> in ggplot layers follows the styling format of <code>%&gt;%</code>"
        },
        {
          "title": "[ ] Code is limited to 80 characters per line, and multiple commands are not combined into one line with <code>;</code>"
        },
        {
          "title": "[ ] If arguments to a function don't all fit on one line, each argument is on its own indented line"
        },
        {
          "title": "[ ] Assignment is made with <code>&lt;-</code> not <code>=</code>"
        },
        {
          "title": "[ ] Text is quoted with <code>\"</code> not <code>'</code>, unless text already contains <code>\"</code>"
        },
        {
          "title": "[ ] <code>TRUE</code> and <code>FALSE</code> are used, not <code>T</code> and <code>F</code>"
        }
      ]
    },
    {
      "topic": "Change control",
      "items": [
        {
          "title": "[ ] Iterative development in the project is annotated through descriptive commits"
        },
        {
          "title": "[ ] Major, minor, and patch modifications to the project are captured in release notes with corresponding release numbering (<code>major.minor.patch</code>)"
        }
      ]
    },
    {
      "topic": "Pitfalls",
      "items": [
        {
          "title": "[ ] No redundant code blocks or comments"
        },
        {
          "title": "[ ] Extraneous data are not stored in the repository or loaded in the project"
        },
        {
          "title": "[ ] No assignment in function calls"
        },
        {
          "title": "[ ] <code>else</code> is used sparingly, if at all (i.e. for readability, it is avoided in favor of <code>if</code> with a guard clause or <code>case_when</code> when the logic is needed in a <code>mutate</code>)"
        },
        {
          "title": "[ ] No instances of <code>attach()</code> or <code>setwd()</code>"
        },
        {
          "title": "[ ] No reliance on a system-specific startup file, such as <code>.Rprofile</code>"
        },
        {
          "title": "[ ] No use of magrittr shortcuts <code>%&lt;&gt;%</code> and omission of <code>()</code> on functions that don’t have arguments"
        }
      ]
    }
  ],
  "sourceUrl": "https://example.com"
}